# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

Sum = int(input('Введите общее количество журавликов: '))
Ser = Pet = Sum // 6
Kat = (Ser + Pet) * 2
print(f'Сережа сделал {Ser}, Петя сделал {Pet}, Катя сделала {Kat}')